Repository: wpilibsuite/frc-docs
Catalog: source/locale/*/LC_MESSAGES/docs/software/wpilib-tools/shuffleboard/getting-started/shuffleboard-tour.po
Languages: fr_ca

source: Tour of Shuffleboard
fr_ca: Aperçu du Shuffleboard

source: Shuffleboard is a dashboard for FRC based on newer technologies such as JavaFX that are available to Java programs. It is designed to be used for creating dashboards for C++ and Java programs. If you've used SmartDashboard in the past then you are already familiar with many of the features of Shuffleboard since they fundamentally work the same way. But Shuffleboard has many features that aren't in SmartDashboard. Here are some of the highlights:
fr_ca: Le Shuffleboard est un tableau de bord en FRC basé sur les plus récentes technologies comme JavaFX qui sont disponibles pour les programmes en Java. Il a été conçu pour permettre de créer des tableaux de bord pour les programmes en C++ et Java. Si, par le passé, vous avez travaillé avec le SmartDashboard alors vous êtes déjà familier avec plusieurs fonctionnalités du Shuffleboard puisque les deux applications remplissent fondamentalement les mêmes fonctions. Cependant le Shuffleboard est doté de plusieurs autres fonctionnalités que le Smartdashboard ne possède pas. En voici quelques-unes parmi les plus en vue :

source: Graphics is based on **JavaFX**, the Java graphics standard. Each of the components has an associated style sheet so it becomes possible to have different "skins" or "themes" for Shuffleboard. We supply default light and dark themes.
fr_ca: Les graphiques sont basés sur **JavaFX**, la norme des graphiques en Java. Chacune des composantes a une feuille de style associée de telle sorte qu’on peut avoir pour le Shuffleboard, une variété de "skins » ou "thèmes ». Les thèmes fournis par défaut sont le clair et le foncé.

source: Shuffleboard supports **multiple sheets for the display of your data**. In fact you can create a new sheet (shown as a tab in the Shuffleboard window) and indicate if and which data should be autopopulated on it. By default there is a Test tab and a SmartDashboard tab that are autopopulated as data arrives. Other tabs might be for robot debugging vs. driving.
fr_ca: Le Shuffleboard prend en charge **plusieurs feuilles pour la visualisation de vos données**. En fait, vous pouvez créer une nouvelle feuille (se présentant sous la forme d’un onglet dans la fenêtre du Shuffleboard) et préciser si et quelles données doivent s'y auto-insérer. Par défaut, il y a un onglet Test et un onglet SmartDashboard qui se remplissent automatiquement de données à mesure que celles-ci sont disponibles. D’autres onglets peuvent être ajoutés pour le débogage du robot vs sa conduite.

source: Graphical **display elements (widgets) are laid out on a grid** to keep the interface clean and easy to read. You can change the grid size to have more or less resolution in your layouts and visual cues are provided to help you change your layout using drag and drop. Or you can choose to turn off the grid lines although the grid layout is preserved.
fr_ca: Les **éléments graphiques d’affichage (widgets) sont disposés sur une grille** pour maintenir l’interface propre et facile à lire. Vous pouvez modifier la taille de la grille pour obtenir plus ou moins de résolution dans vos dispositions et des repères visuels sont fournis pour vous aider à modifier votre disposition à l’aide de glisser-déposer. Vous pouvez également choisir de retirer les lignes de grille et, ce faisant, la disposition de la grille est quand même préservée.

source: Layouts are saved and the previous layout is instantiated by default when you run shuffleboard again.
fr_ca: Les dispositions sont enregistrées et la version la plus récente est celle qui est instanciée par défaut lorsque vous ouvrez à nouveau le Shuffleboard.

source: There is a **record and playback** feature that lets you review the data sent by your robot program after it finishes. That way you can carefully review the actions of the robot if something goes wrong.
fr_ca: Il existe une fonction **record and playback** qui vous permet d’examiner à postériori les données envoyées par le programme de votre robot. De cette façon, si quelque chose ne n'a pas fonctionné normalement, vous pouvez examiner minutieusement les actions du robot.

source: **Graph widgets are available for numeric data** and you can drag data onto a graph to see multiple points at the same time and on the same scale.
fr_ca: **Des widgets graphiques sont disponibles pour les données numériques** et vous pouvez faire glisser ces données sur un graphique pour afficher simultanément plusieurs points et à la même échelle.

source: You can extend Shuffleboard by writing your own widgets that are specific to your team's requirements. Documentation on extending it are on the `Shuffleboard Github Wiki <https://github.com/wpilibsuite/shuffleboard/wiki>`__.
fr_ca: Vous pouvez étendre le Shuffleboard en écrivant vous-mêmes des widgets adaptés aux besoins propres de votre équipe. La documentation relative à cette extension est accessible à `Shuffleboard Github Wiki <https://github.com/wpilibsuite/shuffleboard/wiki>`__.

source: **Sources area:** Here are data sources from which you can choose values from NetworkTables or other sources to display by dragging a value into one of the tabs
fr_ca: **Zone sources:** Dans cette zone se trouvent des sources à l'origine des données dont vous pouvez choisir les valeurs à partir de NetworkTables ou d’autres sources à afficher en faisant glisser une valeur dans l’un des onglets

source: Starting Shuffleboard
fr_ca: Démarrage du Shuffleboard

source: You can start Shuffleboard in one of four ways:
fr_ca: Vous pouvez démarrer le Shuffleboard de l’une des quatre manières suivantes :

source: You can automatically start it when the Driver Station starts by setting the "Dashboard Type" to Shuffleboard in the settings tab as shown in the picture above.
fr_ca: Vous pouvez le lancer automatiquement lorsque la Station de Pilotage démarre en sélectionnant "Shuffleboard" dans "Dashboard Type" de l’onglet settings comme indiqué dans l’image ci-dessus.

source: You can run it by double-clicking the Shuffleboard icon on the Windows Desktop.
fr_ca: Vous pouvez le démarrer en double-cliquant sur l’icône Shuffleboard localisée sur le Bureau Windows.

source: You can start it from the command line by typing the command: ``shuffleboard`` on Windows or ``python shuffleboard.py`` on macOS or Linux from ``~/WPILib/YYYY/tools`` directory (where YYYY is the year and ~ is ``C:\Users\Public`` on Windows). This is often easiest on a a development system that doesn't have the Driver Station installed.
fr_ca: Vous pouvez le lancer à partir de la ligne de commande en tapant la commande : ``shuffleboard`` sur Windows, ``python shuffleboard.py`` sur macOS ou Linux, à partir du répertoire ``~/WPILib/YYYY/tools`` (où YYYY est l’année et ~ est ``C:\Users\Public`` sur Windows). Ceci est souvent plus facile dans un environnement de développement où la station de pilotage n'est pas installée.

source: Getting robot data onto the dashboard
fr_ca: Obtenir les données du robot sur le tableau de bord
